# Powerlevel10k theme - loaded first for prompt
romkatv/powerlevel10k

# Essential productivity plugins
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting

# Oh My Zsh core library (provides git functions, etc.)
ohmyzsh/ohmyzsh path:lib

# Oh My Zsh plugins
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/fzf

# fzf-tab must load after fzf plugin
Aloxaf/fzf-tab

# Advanced history management with SQLite backend
larkery/zsh-histdb
